# UseAnnotationScaleForSingleLineFittings Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctSettings..::..UseAnnotationScaleForSingleLineFittings Property
DuctSettings Class See Also
---
Indicates whether use annotation scale for single line fittings or not.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool UseAnnotationScaleForSingleLineFittings { get; set; }
```

Visual Basic
---
```text
Public Property UseAnnotationScaleForSingleLineFittings As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool UseAnnotationScaleForSingleLineFittings {
	bool get ();
	void set (bool value);
}
```

# See Also
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace